[
{"name": "Active Premium Majesty", "description": "Ready to shatter your distance records? Grab the Majesty and watch it soar past the competition!The Majesty is a wide-rimmed distance driver that's designed to go for maximum distance, thanks to its immense speed. It offers a great glide, good amount of high speed turn and a forward-penetrating fade once the speed starts to slow down. This combination of features makes the Majesty useful tool for many skill levels. We don't recommend the Majesty for beginners however, as those newer to the sport should first hone in their skill with slower and more predictable discs.The durable Active Premium plastic offers a long life for this disc and a great grip for both backhand and sidearm.", "color(s)-weight(size)/qtu": {"Blue": "51", "Pink": "17", "Yellow": "32"}, "price": "15,90 €", "link": "https://europe.discmania.net/collections/distance-drivers/products/active-premium-majesty"},
{"name": "Active Base Mentor", "description": "The Mentor gains more turn the faster it’s thrown meaning you can throw harder for more distance or throw softer for a more controlled stable shot.", "color(s)-weight(size)/qtu": {"Pink": "8"}, "price": "8,90 €", "link": "https://europe.discmania.net/collections/distance-drivers/products/active-mentor"},
{"name": "Soft Exo Logic", "description": "When it comes to your short game, gimmicks can only take you so far. This putter is the logical choice for your putts and approaches.The Logic has a low-profile ergonomic grip designed to fit a variety of preferences when it comes to hand feel. The slightly rounded nose feels very comfortable in hand and releases effortlessly every time. Players that find the  or  to be a bit too deep will surely enjoy how easy the Logic is to grip and control. Our goal was to create something that is very responsive to minor adjustments for all types of throws and won’t burn you if you over-correct too much.As a straighter flying putter copared to the Link, this beadless design allows for an equal amount of glide but will offer an easier trajectory for any player on any line you want to throw it on. Although it’s designed as a putt and approach disc, many players are going to be reaching for this one off the tee as well.", "color(s)-weight(size)/qtu": {"173g / Blue": "8", "173g / Grey": "53", "173g / Pink": "5", "173g / White": "93"}, "price": "12,90 €", "link": "https://europe.discmania.net/collections/putters/products/soft-exo-logic"},
{"name": "Active Base Maestro", "description": "The Maestro is a low profile midrange with a bead that helps flight as well as making sure the disc releases smooth from the hand every time. This midrange has a straight flight with a slight slow speed fade making accurate approach shots a regular part of your game. While most midranges have a larger diameter, the Maestro features the same diameter as drivers and putters making this disc fit more comfortably in the hand. It also offers a great grip for sidearm shots as well.The Discmania Active Base plastic is the perfect balance between keeping the disc firm as well as soft to the touch meaning the disc always feels comfortable and natural in the hand. This same mold of disc was initially offered as Spring Ox. Regardless of the changed names and stamps, the disc itself is the same.: All Active Base material discs come in the 165-175g range.", "color(s)-weight(size)/qtu": {"Blue": "8", "Pink": "3", "White": "9"}, "price": "8,90 €", "link": "https://europe.discmania.net/collections/midrange-drivers/products/active-maestro"},
{"name": "Neo Enigma", "description": "On this very first distance driver released in our Evolution line, the flight numbers really speak for themselves. Get ready to make some room in your distance compartment, because this is a disc you will find yourself relying on shot after shot.While pondering the potential of massive drives and easily controllable distance two key flight components came to mind, 1) enough high-speed turn to maximize distance and 2) enough stability to grant control. For many players, these two key components needed for incredible distance exist in perfect harmony in the Enigma. The sweet spot of turn & stability have been infused with the ability to soar at high speeds and topped off with great glide in this maximum distance driver to form the perfect do-it-all distance driver for most skill levels from advanced and beyond.The Enigma is a wide-rim distance driver that has been shaped to fit all hands. The disc has moderate dome that creates an excellent glide. With a harder pull, the disc turns nicely to give you that extra distance. This disc has a nice, predictable fade that doesn't dump too hard to steal distance from your shot.If you are struggling with the out-of-the-box overstability of some of the most popular Pro level distance drivers out there, we highly recommend giving the Enigma a spin! ", "color(s)-weight(size)/qtu": {"169g / White": "2", "172g / White": "8", "173g / Pink": "4", "173g / White": "1"}, "price": "19,90 €", "link": "https://europe.discmania.net/collections/distance-drivers/products/evolution-neo-enigma"},
{"name": "Hard Exo Method", "description": "The Method was the first midrange disc introduced in our Evolution product line. It is a straight-to-overstable midrange that can handle pro level power on both forehand and backhand shots, but where this disc excels beyond other stable midranges is in its glide.The Method is able maintain a straight and stable flight path even in high speeds without cutting down on distance, giving players more than enough flight time to shape their shots. This midrange can handle immense torque without turning over and will hold a flat to fade flight as it soars down the fairway.The Method features a big bead which helps the disc feel natural in the hand and gives a consistently smooth release.Exo Hard plastic is less durable than Neo, making an excellent disc to cycle through your bag with different levels of stability. Players will notice an overstable flight out of the box and can expect to see more high speed turn over time the more it breaks in.Pro Tip: Exo Hard plastic is the same composition that we offer in the Link. The durability of these is the same as a putter. Hitting a tree or other obstacles will cause noticeable wear quickly compared to other plastics such as Lux or Neo.", "color(s)-weight(size)/qtu": {"177g / Blue": "4", "177g / Grey": "6", "177g / Pink": "6", "177g / White": "7", "178g / White": "1", "179g / White": "2", "180g / Blue": "1", "180g / White": "3"}, "price": "12,90 €", "link": "https://europe.discmania.net/collections/midrange-drivers/products/hard-exo-method"},
{"name": "Active Premium Maestro", "description": "The Maestro is a low profile midrange with a bead that helps flight as well as making sure the disc releases smooth from the hand every time. This midrange has a straight flight with a slight slow speed fade making accurate approach shots a regular part of your game. While most midranges have a larger diameter, the Maestro features the same diameter as drivers and putters making this disc fit more comfortably in the hand. It also offers a great grip for sidearm shots as well.The product names of the Discmania Active line have been updated. The Active baseline plastic version of this disc was initially offered under the name Spring Ox. Also the baseline version was updated to Maestro in 2020. Regardless of the name update, the mold is the same. In the Active Premium material, this disc tends be a little more overstable than in baseline material.Please note: All Active line discs come in approximately 165-170 grams. The ", "color(s)-weight(size)/qtu": {"Blue": "5", "Pink": "15", "Yellow": "4"}, "price": "15,90 €", "link": "https://europe.discmania.net/collections/midrange-drivers/products/active-premium-maestro"},
{"name": "Geo Origin", "description": "This midrange has a lot to offer for all skill levels!The Origin from from our Evolution product line is a smaller diameter midrange with big potential. It is fairly understable at high speeds, making a perfect ally for long turnover shots and precise, laser straight lines when thrown with control. It will thrive in tailwinds, wooded fairways, and calmer conditions out on the course. You will be blown away at how far this disc will fly compared to it’s flight numbers.The smooth rounded feel of the nose provides an excellent feel in hand paired with a gentle false bead to add just a touch of stability. Players will enjoy the tacky plastic that Neo offers and superb gliding ability when thrown at any speed. If Discmania's fan favourite fairway driver Essencehad a mid-range relative, this is it.Good for: Mid range drives, approach shots, all skill levels", "color(s)-weight(size)/qtu": {"171g / White": "11", "171g / Yellow": "1", "172g / Blue": "16", "172g / Yellow": "7", "173g / White": "1"}, "price": "10,90 €", "link": "https://europe.discmania.net/collections/midrange-drivers/products/geo-origin"},
{"name": "Hard Exo Logic (Set of 5)", "description": "Elevate your putting game with a set of matching putters! Buy this bundle and get 5 for the price of 4.Every self-respecting player should have a set of practice putters. With 5 identical putters, you'll easily remove all unwanted disc-related variables for your practice routine, allowing you to focus on technique instead of the disc.When it comes to your short game, gimmicks can only take you so far. This putter is the logical choice for your putts and approaches.The Logic has a low-profile ergonomic grip designed to fit a variety of preferences when it comes to hand feel. The slightly rounded nose feels very comfortable in hand and releases effortlessly every time. Players that find the  or  to be a bit too deep will surely enjoy how easy the Logic is to grip and control. Our goal was to create something that is very responsive to minor adjustments for all types of throws and won’t burn you if you over-correct too much.As a straighter flying putter compared to the Link, this beadless design allows for an equal amount of glide but will offer an easier trajectory for any player on any line you want to throw it on. Although it’s designed as a putt and approach disc, many players are going to be reaching for this one off the tee as well.", "color(s)-weight(size)/qtu": {"173-176g / Blue": "4", "173-176g / Grey": "9", "173-176g / White": "1"}, "price": "51,60 €", "link": "https://europe.discmania.net/collections/putters/products/hard-exo-logic-set-of-5"},
{"name": "Hard Exo Link (Set of 5)", "description": "Elevate your putting game with a set of matching putters! Buy this bundle and get 5 for the price of 4.Every self-respecting player should have a set of practice putters. With 5 identical putters, you'll easily remove all unwanted disc-related variables for your practice routine, allowing you to focus on technique instead of the disc.Link is the first putter released inDiscmania's Evolution line. Just like Discmania's all-time bestselling putter, the P2, the Link is a trustworthy and versatile putter with a slightly lower rim than the P2. The Link has quickly become a top seller worldwide, even challenging the bestseller position of the iconic Discmania P2.The Link has a stable flight for a putter, able to take large amounts of spin without getting floaty and able to glide to the basket without fading out too soon. The Link fits the perfect all around putter for beginners and seasoned pros alike. This putter features a big bead on the rim that makes the Link feel comfortable and helps it glide out of the hand easily on every shot.The Link is slightly shallower than the P2 while not being shallow enough to qualify as low profile. Anyone who’s a fan of the P2 but looking for a little shallower grip will find an immediate comfort in the Link. The Link has a straight flight when thrown, resulting in a putter that can be relied upon for any up shot needed on the green. Attack the basket head on, or adjust the angle of release and have a putter that can crush any hyzer or anhyzer line with enough glide to carry clear down the fairway.You can choose the weight / weight class and colour of your putters from the drop-down menu. All 5 discs in a set come in the same colour. The stamp colours will vary based on availability.", "color(s)-weight(size)/qtu": {"173-176g / Blue": "8", "173-176g / Grey": "11", "173-176g / Pink": "12", "173-176g / White": "20"}, "price": "51,60 €", "link": "https://europe.discmania.net/collections/putters/products/exo-hard-link-set-of-5"},
{"name": "Neo Method", "description": "If you need to get things done, having the right Methods will make things easier for you. This disc has been designed to be a true workhorse for an array of different shots.The Method was the first midrange disc introduced in our Evolution product line. It is a straight-to-overstable midrange that can handle pro level power on both forehand and backhand shots, but where this disc excels beyond other stable midranges is in its glide.The Method is able maintain a straight and stable flight path even in high speeds without cutting down on distance, giving players more than enough flight time to shape their shots. This midrange can handle immense torque without turning over and will hold a flat to fade flight as it soars down the fairway.The Method features a big bead which helps the disc feel natural in the hand and gives a consistently smooth release. The Neo plastic material features a great grip and its durability ensures a long life for your Method. ", "color(s)-weight(size)/qtu": {"173g / White": "1", "177g / Pink": "7", "178g / White": "2", "179g / White": "8"}, "price": "19,90 €", "link": "https://europe.discmania.net/collections/midrange-drivers/products/neo-method"},
{"name": "Neo Origin", "description": "This midrange has a lot to offer for all skill levels!The Origin from from our Evolution product line is a smaller diameter midrange with big potential. It is fairly understable at high speeds, making a perfect ally for long turnover shots and precise, laser straight lines when thrown with control. It will thrive in tailwinds, wooded fairways, and calmer conditions out on the course. You will be blown away at how far this disc will fly compared to it’s flight numbers.The smooth rounded feel of the nose provides an excellent feel in hand paired with a gentle false bead to add just a touch of stability. Players will enjoy the tacky plastic that Neo offers and superb gliding ability when thrown at any speed. If Discmania's fan favourite fairway driver Essencehad a mid-range relative, this is it. Mid range drives, approach shots, all skill levels", "color(s)-weight(size)/qtu": {"171g / White": "2", "172g / Bright Yellow": "3", "172g / White": "5", "173g / Bright Yellow": "9", "173g / Clear": "1", "174g / Clear": "5", "174g / Green": "4", "174g / Light Green": "3", "175g / White": "4", "177g / Sky Blue": "9", "177g / White": "8"}, "price": "19,90 €", "link": "https://europe.discmania.net/collections/midrange-drivers/products/neo-origin"},
{"name": "Soft Exo Tactic", "description": "The Tactic is a truly overstable throwing putter. You can throw it with confidence and putt reliably into strong winds. The exceptionally low glide improves the control even further. It’s great for all types of shot selection, and the variety of plastics available allow you to experiment with which one suits you best.The Soft Exo plastic helps the Tactic have more give to the flight plate allowing for players to really dig into their putters and get an incredible amount of grip on their disc. Being soft in rigidity and feel makes Soft Exo the plastic of choice for players looking to optimize comfort and grip. The Soft Exo plastic is historically the most overstable of the three plastics we offer between Soft, Hard, and Vapor.", "color(s)-weight(size)/qtu": {"173g / Blue": "1", "173g / Grey": "1", "173g / White": "28"}, "price": "12,90 €", "link": "https://europe.discmania.net/collections/putters/products/evolution-exo-soft-tactic"},
{"name": "Hard Exo Link", "description": "The Link was the first putter released in Evolution line and it has quickly become a true crowd favourite. Just like our all-time bestselling putter, the P2, the Link is a trustworthy and versatile putter with a slightly lower rim than the P2.The Link has a stable flight for a putter, able to handle a lot of spin without getting floaty and able to soar to the basket without fading out too soon. The Link fits the perfect all around putter for beginners and seasoned pros alike. This putter features a bead on the rim that makes the Link feel comfortable and helps it glide out of the hand easily on every shot.The Link is slightly shallower than the P1 and P2 while not being shallow enough to qualify as low profile. Anyone who’s a fan of the P1's & P2's but looking for a little shallower grip will find immediate comfort in the Link. The Link has a straight flight when thrown with some power, resulting in a putter that can be relied upon for any up shot needed on the green. Attack the basket head on, or adjust the angle of release and have a putter that can crush any hyzer or anhyzer line with enough glide to carry clear down the fairway.", "color(s)-weight(size)/qtu": {"173g / Blue": "1", "173g / Pink": "7", "174g / Blue": "12", "174g / Pink": "8", "174g / White": "14", "176g / Grey": "16", "176g / Pink": "3", "176g / White": "27"}, "price": "12,90 €", "link": "https://europe.discmania.net/collections/putters/products/evolution-exo-hard-link"},
{"name": "Active Base Sensei", "description": "The Sensei is a low profile putter that fits well in any hand size. The disc is designed for all types of approach shots and putts.The flight of this disc is straight in high speeds and it offers a dependable fade as the speed and rotation slows down. Great choice for beginners and more experienced players alike! This same mold of disc was initially offered as \"Guardian Lion\" and \"Tiger Warrior\". Regardless of the changed names and stamps, the disc itself is the same.: All Active Base material discs come in the 165-175g range.", "color(s)-weight(size)/qtu": {"Blue": "36", "Pink": "29", "White": "76"}, "price": "8,90 €", "link": "https://europe.discmania.net/collections/putters/products/active-sensei"},
{"name": "Active Base Sensei (Set of 5)", "description": "Elevate your putting game with a set of matching putters! Buy this bundle and get 5 for the price of 4.Every self-respecting player should have a set of practice putters. With 5 identical putters, you'll easily remove all unwanted disc-related variables for your practice routine, allowing you to focus on technique instead of the disc.The Sensei is a low profile putter that fits well in any hand size. The disc is designed for all types of approach shots and putts.The flight of this disc is straight in high speeds and it offers a dependable fade as the speed and rotation slows down. Great choice for beginners and more experienced players alike! This same mold of disc was initially offered as \"Guardian Lion\" and \"Tiger Warrior\". Regardless of the changed names and stamps, the disc itself is the same.: All Active Base material discs come in the 165-175g range.", "color(s)-weight(size)/qtu": {"Blue": "24", "White": "23"}, "price": "35,60 €", "link": "https://europe.discmania.net/collections/putters/products/active-base-sensei-set-of-5"},
{"name": "Active Premium Magician", "description": "Highly versatile fairway driver for most skill levels!The Magician is a stable fairway driver designed to give all players a fairway driver that can be trusted in all conditions. The Magician flies straight with minimal turn and a reliable fade at the end giving this disc a flight that can be trusted and repeated. The stability of the Magician allows it to be a great forehand approach disc in addition to its backhand capabilities. Rated at a speed 6, the Magician has a smaller rim that makes this disc comfortable for all hand sizes. The grippy and durable Active Premium plastic offers a long life to this disc. This plastic tends to make the discs a touch more overstable than the same mold in baseline plastic.", "color(s)-weight(size)/qtu": {"Blue": "69", "Pink": "58", "Yellow": "47"}, "price": "15,90 €", "link": "https://europe.discmania.net/collections/fairway-drivers/products/active-premium-magician"},
{"name": "Geo Essence", "description": "A whole bunch of glide and the perfect ratio of high speed turn & low speed fade. This disc has a lot offer for everyone!The Essence is THE do-it-all fairway driver in our Evolution line up. Although the Essence is a great fit for beginner and novice throwers, many pros out there will take a liking to this disc quickly. The rounded semi-blunt nose of the disc allows for fantastic roller shots and controlled backhand or forehand throws when you need it most. If you find yourself on a technical hole out on the course, you’ll reach for the Essence!With the Essence, we have repurposed, reimagined, and reinvented our goals for an understable fairway driver. Given the understable nature of the Essence, this disc is best suited for players looking for their first fairway driver, backhand or smooth forehand throws, tailwinds, and excellent roller shots.In Geo material, the Essence features a flatter profile than in Neo. This makes the Geo Essence a touch more stable and less glidey than its Neo relative. If you're looking for a disc with more turn and glide, we recommend picking up the Neo Essence instead.All skill levels, straight and turning shots from backhand & sidearm.", "color(s)-weight(size)/qtu": {"171g / White": "3"}, "price": "10,90 €", "link": "https://europe.discmania.net/collections/fairway-drivers/products/geo-essence"},
{"name": "Neo Essence", "description": "A whole bunch of glide and the perfect ratio of high speed turn & low speed fade. This bestseller disc has a lot offer for everyone!The Essence is THE do-it-all fairway driver in our Evolution line up. Although the Essence is a great fit for beginner and novice throwers, many pros out there will take a liking to this disc quickly. The rounded semi-blunt nose of the disc allows for fantastic roller shots and controlled backhand or forehand throws when you need it most. If you find yourself on a technical hole out on the course, you’ll reach for the Essence!With the Essence, we have repurposed, reimagined, and reinvented our goals for an understable fairway driver. Given the understable nature of the Essence, this disc is best suited for players looking for their first fairway driver, backhand or smooth forehand throws, tailwinds, and excellent roller shots.In Neo material, the Essence features a fair bit of dome. This offers the Essence a huge glide that's useful on those long turning drives and flip-up shots on tight fairways.All skill levels, straight and turning shots from backhand & sidearm.", "color(s)-weight(size)/qtu": {"167g / Yellow Green": "1", "168g / Light Green": "2"}, "price": "19,90 €", "link": "https://europe.discmania.net/collections/fairway-drivers/products/neo-essence"},
{"name": "Active Premium Rockstar", "description": "The Rockstar is a beginner friendly fairway driver for most skill levels.Designed with the player in mind, this disc allows easy access to begin opening up your game to untapped distance and control. Golfers with more experience and power will find this disc to be moderately under stable and will display more high-speed turn from the flight.Beginner to intermediate level players are going to enjoy the smooth nature of it’s flight patterns, superb gliding ability, and adaptability to both forehand and backhand throws. Rockstar features a thin rounded nose with gentle wing on the underside of the disc, making for an extremely comfortable fit in your hand.The grippy and durable Active Premium plastic offers a long life for this disc. Beginner to intermediate level players, forehand/backhand drives, tailwind", "color(s)-weight(size)/qtu": {"Blue": "22", "Pink": "27", "Yellow": "27"}, "price": "15,90 €", "link": "https://europe.discmania.net/collections/fairway-drivers/products/active-premium-rockstar"},
{"name": "Active Base Magician", "description": "Highly versatile fairway driver for most skill levels!The Magician is a stable fairway driver designed to give all players a fairway driver that can be trusted in all conditions. The Magician flies straight with minimal turn and a reliable fade at the end giving this disc a flight that can be trusted and repeated. The stability of the Magician allows it to be a great forehand approach disc in addition to its backhand capabilities. Rated at a speed 6, the Magician has a smaller rim that makes this disc comfortable for all hand sizes. ", "color(s)-weight(size)/qtu": {"Blue": "24", "Pink": "14", "White": "26"}, "price": "8,90 €", "link": "https://europe.discmania.net/collections/fairway-drivers/products/active-magician"},
{"name": "Neo Instinct", "description": "When in doubt, trust your instincts! The Instinct was the first fairway driver and the very first disc released in our Evolution line and has quickly become the number one workhorse driver for many players of many skill levels. It offers the perfect blend of control and stability, resulting in a fairway driver that can be depended on for touch shots as well as big crushes down the fairway. The disc is a glide machine and makes your control drives longer. Evolve your game by trusting your instincts!Control drives, sidearms, for advanced and Pro players", "color(s)-weight(size)/qtu": {"169g / Pink": "5", "169g / Sky Blue": "1", "171g / Bright Yellow": "2", "171g / White": "2"}, "price": "19,90 €", "link": "https://europe.discmania.net/collections/fairway-drivers/products/neo-instinct"},
{"name": "Hard Exo Tactic", "description": "Add a new dimension of reliability for your short game with the Tactic!The Tactic is a truly overstable throwing putter. You can throw it with confidence and putt reliably into strong winds. The low glide improves the control even further. It’s great for all types of shot selection, and the variety of plastics available allow you to experiment with which one suits you best.The Hard Exo plastic gives the Tactic enough rigidity for players to be confident that the disc will retain its shape, even for players with a firm grip. While remaining firm, the Hard Exo plastic has a soft velvet like feel to its surface making this plastic both reliable and comfortable to the touch. The Hard Exo plastic is a bit more rigid in the hand and will allow some ground play to add more desirable options when thrown as intended.", "color(s)-weight(size)/qtu": {"173g / Blue": "5", "173g / Pink": "3", "174g / Pink": "1", "176g / Blue": "1"}, "price": "12,90 €", "link": "https://europe.discmania.net/collections/putters/products/evolution-exo-hard-tactic"},
{"name": "Soft Exo Link (Set of 5)", "description": "Elevate your putting game with a set of matching putters! Buy this bundle and get 5 for the price of 4.Every self-respecting player should have a set of practice putters. With 5 identical putters, you'll easily remove all unwanted disc-related variables for your practice routine, allowing you to focus on technique instead of the disc.Link is the first putter released inDiscmania's Evolution line. Just like Discmania's all-time bestselling putter, the P2, the Link is a trustworthy and versatile putter with a slightly lower rim than the P2. The Link has quickly become a top seller worldwide, even challenging the bestseller position of the iconic Discmania P2.The Link has a stable flight for a putter, able to take large amounts of spin without getting floaty and able to glide to the basket without fading out too soon. The Link fits the perfect all around putter for beginners and seasoned pros alike. This putter features a big bead on the rim that makes the Link feel comfortable and helps it glide out of the hand easily on every shot.The Link is slightly shallower than the P2 while not being shallow enough to qualify as low profile. Anyone who’s a fan of the P2 but looking for a little shallower grip will find an immediate comfort in the Link. The Link has a straight flight when thrown, resulting in a putter that can be relied upon for any up shot needed on the green. Attack the basket head on, or adjust the angle of release and have a putter that can crush any hyzer or anhyzer line with enough glide to carry clear down the fairway.You can choose the weight / weight class and colour of your putters from the drop-down menu. All 5 discs in a set come in the same colour. The stamp colours will vary based on availability.", "color(s)-weight(size)/qtu": {"173-176g / Blue": "10", "173-176g / Grey": "15", "173-176g / Pink": "13", "173-176g / White": "8"}, "price": "51,60 €", "link": "https://europe.discmania.net/collections/putters/products/soft-exo-link-set-of-5"},
{"name": "Soft Exo Link", "description": "The Link was the first putter released in Evolution line and it has quickly become a true crowd favourite. Just like our all-time bestselling putter, the P2, the Link is a trustworthy and versatile putter with a slightly lower rim than the P2The Link has a stable flight for a putter, able to handle a lot of spin without getting floaty and able to soar to the basket without fading out too soon. The Link fits the perfect all around putter for beginners and seasoned pros alike. This putter features a bead on the rim that makes the Link feel comfortable and helps it glide out of the hand easily on every shot.The Link is slightly shallower than the P1 and P2 while not being shallow enough to qualify as low profile. Anyone who’s a fan of the P1's & P2's but looking for a little shallower grip will find immediate comfort in the Link. The Link has a straight flight when thrown with some power, resulting in a putter that can be relied upon for any up shot needed on the green. Attack the basket head on, or adjust the angle of release and have a putter that can crush any hyzer or anhyzer line with enough glide to carry clear down the fairway.", "color(s)-weight(size)/qtu": {"174g / Grey": "1", "174g / Pink": "1", "175g / Blue": "4", "175g / Grey": "6", "176g / Blue": "15", "176g / Grey": "11", "176g / Pink": "11", "176g / White": "9"}, "price": "12,90 €", "link": "https://europe.discmania.net/collections/putters/products/soft-exo-link"},
{"name": "Active Base Shogun", "description": "The Shogun is the master of putting greens and upshots from all distances.The Shogun is a \"deep dish\" beaded putter that you'll love for both putts and upshots. Designed to withstand a good amount of power, this putter provides a comfortable ergonomic feel and reliable flight when thrown off the tee and for putt/approach.The Shogun will provide relatively straight flight patterns with a little bit of low speed fade, allowing it to withstand moderate wind resistance with point-and-shoot accuracy.: We might be biased, but this putter has ridiculously good hand feel and it provides a very impressive flight pattern. Instant staff favourite! Tee shots, approach shots, putting", "color(s)-weight(size)/qtu": {"Blue": "19", "Pink": "21", "White": "71"}, "price": "8,90 €", "link": "https://europe.discmania.net/collections/putters/products/active-base-shogun"},
{"name": "Active Premium Sensei", "description": "The Active Premium Sensei is a true crowd favourite for upshots and putter drives off the tee!The Sensei is a low profile putter that fits well in any hand size. The disc is designed for all types of approach shots and putts.The flight of this disc is straight in high speeds and it offers a dependable fade as the speed and rotation slows down. Great choice for beginners and more experienced players alike!The product names of the Discmania Active line have been updated since the initial release of this product line. The Active baseline plastic version of this disc was previously offered under the nameTiger Warriorand has been updated toSensei. Regardless of the name update, the mold is the same.Please note: All Active line discs come in approximately 165-170 grams. The ", "color(s)-weight(size)/qtu": {"Blue": "14", "Pink": "22", "Yellow": "19"}, "price": "15,90 €", "link": "https://europe.discmania.net/collections/putters/products/active-premium-sensei"},
{"name": "Soft Exo Logic (Set of 5)", "description": "Elevate your putting game with a set of matching putters! Buy this bundle and get 5 for the price of 4.Every self-respecting player should have a set of practice putters. With 5 identical putters, you'll easily remove all unwanted disc-related variables for your practice routine, allowing you to focus on technique instead of the disc.When it comes to your short game, gimmicks can only take you so far. This putter is the logical choice for your putts and approaches.The Logic has a low-profile ergonomic grip designed to fit a variety of preferences when it comes to hand feel. The slightly rounded nose feels very comfortable in hand and releases effortlessly every time. Players that find the  or  to be a bit too deep will surely enjoy how easy the Logic is to grip and control. Our goal was to create something that is very responsive to minor adjustments for all types of throws and won’t burn you if you over-correct too much.As a straighter flying putter compared to the Link, this beadless design allows for an equal amount of glide but will offer an easier trajectory for any player on any line you want to throw it on. Although it’s designed as a putt and approach disc, many players are going to be reaching for this one off the tee as well.", "color(s)-weight(size)/qtu": {"173-176g / Blue": "9", "173-176g / Grey": "17", "173-176g / Pink": "6"}, "price": "51,60 €", "link": "https://europe.discmania.net/collections/putters/products/soft-exo-logic-set-of-5"},
{"name": "Geo Link", "description": "The Link was the first putter released in Evolution line and it has quickly become a true crowd favourite. Just like our all-time bestselling putter, the P2, the Link is a trustworthy and versatile putter with a slightly lower rim than the P2.The Link has a stable flight for a putter, able to handle a lot of spin without getting floaty and able to soar to the basket without fading out too soon. The Link fits the perfect all around putter for beginners and seasoned pros alike. This putter features a bead on the rim that makes the Link feel comfortable and helps it glide out of the hand easily on every shot.The Link is slightly shallower than the P1 and P2 while not being shallow enough to qualify as low profile. Anyone who’s a fan of the P1's & P2's but looking for a little shallower grip will find immediate comfort in the Link. The Link has a straight flight when thrown with some power, resulting in a putter that can be relied upon for any up shot needed on the green. Attack the basket head on, or adjust the angle of release and have a putter that can crush any hyzer or anhyzer line with enough glide to carry clear down the fairway.", "color(s)-weight(size)/qtu": {"173g / Blue": "15", "173g / Light Blue": "4", "174g / Almost White": "5", "174g / Light Blue": "4", "174g / Light Colour (with a hint of yellow)": "4", "174g / White": "5", "175g / Blue": "1", "175g / Light Blue": "11", "176g / Light Blue": "13"}, "price": "10,90 €", "link": "https://europe.discmania.net/collections/putters/products/geo-link"},
{"name": "Hard Exo Logic", "description": "When it comes to your short game, gimmicks can only take you so far. This putter is the logical choice for your putts and approaches.The Logic has a low-profile ergonomic grip designed to fit a variety of preferences when it comes to hand feel. The slightly rounded nose feels very comfortable in hand and releases effortlessly every time. Players that find the  or  to be a bit too deep will surely enjoy how easy the Logic is to grip and control. Our goal was to create something that is very responsive to minor adjustments for all types of throws and won’t burn you if you over-correct too much.As a straighter flying putter compared to the Link, this beadless design allows for an equal amount of glide but will offer an easier trajectory for any player on any line you want to throw it on. Although it’s designed as a putt and approach disc, many players are going to be reaching for this one off the tee as well.About Hard Exo material: The Hard Exo plastic gives the Link enough rigidity for players to be confident that the disc will retain its shape, even for players with a firm grip. While remaining firm, the hard Exo plastic has a soft velvet like feel to its surface making this plastic both reliable and comfortable to the touch.", "color(s)-weight(size)/qtu": {"173g / Blue": "8", "173g / Grey": "40", "173g / Pink": "16", "173g / White": "101", "175g / Blue": "13", "175g / Grey": "15"}, "price": "12,90 €", "link": "https://europe.discmania.net/collections/putters/products/hard-exo-logic"}
]